% 행렬 만들기 및 연산
clear all; close all; clc;

% 2x3 A
% 1 2 3
% 4 5 6

% 3x2 B
% -1 -2
% -3 -4
% -5 -6

% 3x3 C
% 1 2 3
% 4 5 6
% 7 8 9

% 각 행을 ;으로 분리
A = [1 2 3; 3 5 6];
B = [-1 -2; -3 -4; -5 -6];
C = [1 2 3; 4 5 6; 7 8 1];
D = [7 8 1; 1 2 3; 4 5 6];

% 또는 행별로 데이터 삽입
A = [];
A(1,:) = [1 2 3];
A(2,:) = [3 4 5];

B = [];
B(1,:) = [-1 -2];
B(2,:) = [-3 -4];
B(3,:) = [-5 -6];

C = [];
C(1,:) = [1 2 3];
C(2,:) = [4 5 6];
C(3,:) = [7 8 1];

D = [];
D(1,:) = [7 8 1];
D(2,:) = [1 2 3];
D(3,:) = [4 5 6];

A*B % 2x3 * 3x2
%Y = B*C % 3x2 * 3x3 (불가능 행렬이 맞지 않음)

%A+B % 2x3 + 3x2 (불가능 두 행렬이 다름)
A+transpose(B) % 2x3 + 2x3
A+B'

%det(A) % 2x3 (불가능 정사각행렬이 아님)
det(C) % 3x3

%inv(A) % 2x3 불가능 (행과 열의 개수가 같은 정방행렬에서만 가능)
inv(C) % 3x3
C^-1

% 행렬의 특성 CD != DC
C*D
D*C

% 행렬 특성 (CD)^-1 = D^-1 * C^-1
inv(D)*inv(C)
inv(C*D)
